Revit 2026 API

# MaterialShininess Property

---

The shininess of the material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Shininess { get; set; }
```
```vb
Public Property Shininess As Integer
	Get
	Set
```
```cpp
public:
property int Shininess {
	int get ();
	void set (int value);
}
```
```fsharp
member Shininess : int with get, set
```

#### Property Value

Int32 The value ranges from 0 to 128.

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: values for shininess must be between 0 and 128 |

#### Reference

Material Class

Autodesk.Revit.DB Namespace